
#不同役种
Yi_man = ["天胡", "地胡", "九莲宝灯", "国士无双", "绿一色",
                  "字一色", "四暗刻", "小四喜", "清老头", "四杠子", "大三元"]
DoubleYi_man = ["纯正九莲宝灯", "国士无双十三面", "四暗刻单骑", "大四喜"]
Six_Fan = ["清一色"]
Three_Fan = ["混一色", "纯全带幺九", "二杯口"]
Two_Fan = ["七对子", "两立直", "一气通贯", "混全带幺九", "三色同顺", "三色同刻",
            "三暗刻", "混老头", "三杠子", "小三元", "抢杠", "岭上开花",
            "海底摸月", "河底摸鱼"]
One_Fan = ["断幺九", "一发", "对对和", "立直", "门前清自摸和", "平和", "一杯口"]

#不同役种对应分数
Yi_man_Score = 32
DoubleYi_man_Score = 54
Six_Fan_Score = 6
Three_Fan_Score = 3
Two_Fan_Score = 2
One_Fan_Score = 1

