
#不同役种
Yi_man = ["天和", "地和", "九莲宝灯", "国士无双", "绿一色",
                  "字一色", "四暗刻", "小四喜", "清老头", "四杠子", "大三元","流局满贯"]
DoubleYi_man = ["纯正九莲宝灯", "国士无双十三面", "四暗刻单骑", "大四喜"]
Six_Fan = ["清一色"]
# 漏出清一色 -1分
Three_Fan = ["混一色", "纯全带幺九", "二杯口"]
Two_Fan = ["七对子", "两立直", "一气通贯", "混全带幺九", "三色同顺", "三色同刻",
            "三暗刻", "混老头", "三杠子", "小三元", "枪杠", "岭上开花",
            "海底摸月", "河底捞鱼"]
#纯全带幺九 混全带幺九 一气通贯 三色同顺 漏出-1分
One_Fan = ["对对和"]
Alarm1 = ["清一色","纯全带幺九","混全带幺九","一气通贯","三色同顺"]
Alarm2 = ["混一色"]

Minus = {"清一色":"6番",
         "纯全带幺九":"3番",
         "混一色":"3番",
         "混全带幺九":"2番",
         "一气通贯":"2番",
         "三色同顺":"2番"}

#不同役种对应分数
Yi_man_Score = 32
DoubleYi_man_Score = 54
Six_Fan_Score = 6
Three_Fan_Score = 3
Two_Fan_Score = 2
One_Fan_Score = 1

